content/306.2_ES221_Fall2024.org
#+TITLE: ES 221: Mechanics of Solids - Fall 2024
# #+OPTIONS: 
#+OPTIONS: toc:1

* Basic Information
|-------------------+-----------------------------------------|
| Class timings     | Wednesday, Friday, 10:00-11:20 hrs      |
| Class location    | AB 7/101                                |
|-------------------+-----------------------------------------|
| Instructor        | Gaurav Srivastava (gauravs@iitgn.ac.in) |
|-------------------+-----------------------------------------|
| Tutorial timings  | Thursday, 22:00-23:20 hrs               |
| Tutorial location | AB 7/101                                |
|-------------------+-----------------------------------------|
| TA                | Yajat Sharma (yajat.sharma@iitgn.ac.in) |
|-------------------+-----------------------------------------|


* Course objectives, syllabus, books, pre-requisites
** Objectives
- To learn how materials behave in engineering applications.
- To learn how small and large natural and engineered systems remain stable/fail.
- To get an idea about design and analysis of different systems such as dams, buildings, bridges, etc.
	
** Syllabus
- Free body diagram, Modeling of supports, Conditions for Equilibrium.
- Friction Force-deformation relationship and geometric compatibility (for small deformations) with illustrations through simple problems on axially loaded members and thin walled pressure vessels.
- Axial force, shear force, bending moment, and twisting moment diagrams of slender members.
- Concept of stress and strain at a point, Transformation of stresses and strain at a point, Principal stresses and strains, Mohr’s circle (only for plane stress and strain case).
- Displacement field, Strain Rosette, Modeling of problem as a plane stress or plane strain problem.
- Discussion of experimental results on 1-D material behavior.
- Concepts of elasticity, plasticity, strain-hardening, failure (fracture/yielding), idealization of 1-D stress-strain curve, Concepts of isotropy, orthotropy, anisotropy.
- Generalized Hooke’s law, (without and with thermal strains).
- Torsion of circular shafts and thin-walled tubes.
- Bending of beams with symmetric cross-section (normal and shear stresses), Combined stresses, Yield criteria, Deflection due to bending.
- Integration of the moment-curvature relationship for simple boundary conditions, Super position principle.
- Concepts of strain energy and complementary strain energy for simple structural elements (those under axial load, shear force, bending moment, and torsion).
- Castigliano’s theorems for deflection analysis and indeterminate problems.
- Concept of elastic instability and a brief introduction to column buckling and Euler’s formula. 
		
** Textbook
- *B1*: Engineering Mechanics: Statics - R.C. Hibbeler (14th edition).
- *B2*: Mechanics of Materials - R.C. Hibbeler (10th edition).
# comment
	
** Reference Books
- Strength of Materials - S. Timoshenko.

** Pre-requisites
- Good background in Mathematics.
- Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.

* Course Policies
** Etiquette
- Please be considerate about everyone's time.
- In all emails pertaining to this course, please have "ES221" in the subject line.
	- (note that there is no space or hyphen or anything between ES and 221)

** Cheating
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.

** Grading
Following will be the weightage of different components of assessment
| Component            | Weightage |
|----------------------+-----------|
| Homework assignments |       20% |
| In-class submissions |       25% |
| Tutorials            |       25% |
| Exams (two)          |  15% each |

** Modes of formal assessment
- Tutorials will involve two types of problems:
	- Set A: to be submitted within the tutorial session and will be graded towards Tutorial weightage
	- Set B: to be practiced outside the tutorial hour and will not be graded
- Assignments will entail analysis/practical problems, reports, etc. and may be individual or group
- Expect one assignment and tutorial per week.
- All assignments and tutorials can be downloaded from [[https://drive.google.com/drive/folders/1xh3KbURRTQPupLBcsRxMVuHeTEFI5BDN?usp=drive_link][this google folder]].
	
** Emphasis on self-learning
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.

* Calendar (tentative)
** [L1] Aug 02, Fri
- Introduction to the subject, solids vs. fluids, rigidity vs. flexibility. Failure modes of solids.
- Fundamental vs. derived quantities, dimensional analysis.
- SI units (base and derived).
- Significant figures and scientific notation, rounding off.
- Newton's laws of motion - first, second and third.
- Force systems - coplanar, collinear, concurrent.
- Moment of force.
- Resultant force and moment. Equations of static equilibrium.
- /Reading from the book (B1)/: Chapters 1-4.
** [T1] Aug 05, Mon
- Review of topics from Class XI.
** [L2] Aug 07, Wed
- Moment of a force, couple moment. Equations of static equilibrium.
- Idealization of supports - fixed, roller, hinged.
- External and internal forces.
- Examples of determining support reactions and internal forces.
- /Reading from the book (B1)/: Chapter 5.
** [L3] Aug 09, Fri
- Two-force members.
- Introduction to truss structures.
- Analysis of pin-jointed trusses by method of joints.
- /Reading from the book (B1)/: Chapters 5 & 6.
** [L4] Aug 14, Wed
- /In-class submission C1/
- Analysis of pin-jointed trusses by method of sections.
- /Reading from the book (B1)/: Chapter 6.
** Aug 15, Thu - holiday (Independence Day)
** [L5] Aug 16, Fri
- Classification and idealization of structural members by geometry (1D, 2D, 3D).
- Classification and idealization of structural members by resisting action (tie, strut, beam, column, shaft).
- Bending moment and shear forces in beams. Sign convention for bending moment.
- /Reading from the book (B1)/: Chapter 7.
** [L6] Aug 21, Wed
- Class cancelled.
** [T2] Aug 22, Thu
- Analysis of pin-jointed trusses.
** [L7] Aug 23, Fri
- /Assignment 1/ given (due on 30 Aug).
- Bending moment and shear force diagrams. Sign convention for shear force.
- /Reading from the book (B1)/: Chapter 7.
** [L8] Aug 28, Wed
- Bending moment and shear force diagrams.
- /Reading from the book (B1)/: Chapter 7.
** [T3] Aug 29, Thu
- Bending moment and shear force diagrams.
** [L9] Aug 30, Fri
- /Assignment 2/ given (due on 6 Sep).
- Concept of stress. Normal and shear stresses. General state of stress. Sign convention.
- Area as a vector. Average stresses. Examples of finding normal stress.
- Concept of strain. Normal and shear strain. General state of strain. Sign convention.
- Average strain. Examples of finding normal strain.
- /Reading from the book (B2)/: Chapters 1 and 2.
** [L10] Sep 04, Wed
- Material properties. Relations between stress and strain.
- Young's modulus, shear modulus, Poisson ratio.
- Hooke's law.
** [T4] Sep 05, Thu
- Stress and strain computations.
** [L11] Sep 06, Fri
- Strain at a point.
- Strain compatibility conditions.
- Transformation of strain.
- Principal stresses.
- Principal strains.
- Stresses.
- Hooke's law and stress-strain relations.
** [L12] Sep 11, Wed
- Relations between different elastic constants (Young's modulus, shear modulus, bulk modulus).
- Idealization of 1D stress-strain curve.
** [T5] Sep 12, Thu
- Strain at a point.
- Stress in cylindrical coordinates.
** [L13] Sep 13, Fri
- Elastic energy / strain energy in a body.
** [L14] Sep 18, Wed
- Yield criteria and conditions.
** [T6] Sep 19, Thu
** [L15] Sep 20, Fri
- Equivalence of yield stresses.
** [L16] Sep 25, Wed
- Review of topics.
** [T7] Sep 24, Thu
- Strain energy and yield conditions.
- Failure theories.
** Sep 27 - Oct 04: Mid semester exam week
** Oct 05 - 13: Mid semester recess
** [L17] Oct 16, Wed
- Consideration of bending.
- Shear force and bending moment diagrams.
** [T8] Oct 17, Thu
- Failure theories.
** [L18] Oct 18, Fri
- Shear force and bending moment diagrams.
** [L19] Oct 23, Wed
- Stresses due to bending.
** [T9] Oct 24, Thu
- Shear force and bending moment diagrams.
** [L20] Oct 25, Fri
- Stresses due to bending.
** [L21] Oct 30, Wed
- Deflections due to bending.
** [T10] Oct 31, Thu
- Stresses due to bending.
** [L22] Nov 01, Fri
- Torsion of circular members.
** [L23] Nov 06, Wed
- Castigliano's theorems.
** [T11] Nov 07, Thu
- Deflections due to bending.
** [L24] Nov 08, Fri
- Torsion of circular members.
- State of stress in members with torsion and axial force.
** [L25] Nov 13, Wed
- Stability of equilibrium.
- Buckling of slender members.
** [T12] Nov 14, Thu
- Torsion of circular members.
** Nov 15, Fri - holiday (Guru Nanak's Birthday)
** [L26] Nov 20, Wed
- Buckling of slender members.
** [T13] Nov 21, Thu
- Stability of equilibrium.
- Buckling of slender members.
** [L27] Nov 22, Fri
- Review of topics.
** Nov 23 - 29: End semester exam week
