306.2_ES221_Fall2024.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-30 Fri 04:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>ES 221: Mechanics of Solids - Fall 2024</title>
<meta name="generator" content="Org mode" />

<link rel='stylesheet' href='gs_simple.css' />
</head>
<body>
<div id="preamble" class="status">

<center>
<nav>
<a href="/index.html">Home</a>
<a href="/research.html">Research</a>
<a href="/teaching.html">Teaching</a>
<a href="/students.html">Students</a>
</nav>
</center>
</div>
<div id="content">
<h1 class="title">ES 221: Mechanics of Solids - Fall 2024</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgb89da37">Basic Information</a></li>
<li><a href="#org3e6cf35">Course objectives, syllabus, books, pre-requisites</a></li>
<li><a href="#org2a4e6d7">Course Policies</a></li>
<li><a href="#orgc69d4dc">Calendar (tentative)</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgb89da37" class="outline-2">
<h2 id="orgb89da37">Basic Information</h2>
<div class="outline-text-2" id="text-orgb89da37">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Class timings</th>
<th scope="col" class="org-left">Wednesday, Friday, 10:00-11:20 hrs</th>
</tr>

<tr>
<th scope="col" class="org-left">Class location</th>
<th scope="col" class="org-left">AB 7/101</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Instructor</td>
<td class="org-left">Gaurav Srivastava (gauravs@iitgn.ac.in)</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Tutorial timings</td>
<td class="org-left">Thursday, 22:00-23:20 hrs</td>
</tr>

<tr>
<td class="org-left">Tutorial location</td>
<td class="org-left">AB 7/101</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">TA</td>
<td class="org-left">Yajat Sharma (yajat.sharma@iitgn.ac.in)</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-org3e6cf35" class="outline-2">
<h2 id="org3e6cf35">Course objectives, syllabus, books, pre-requisites</h2>
<div class="outline-text-2" id="text-org3e6cf35">
</div>
<div id="outline-container-orgdafabe5" class="outline-3">
<h3 id="orgdafabe5">Objectives</h3>
<div class="outline-text-3" id="text-orgdafabe5">
<ul class="org-ul">
<li>To learn how materials behave in engineering applications.</li>
<li>To learn how small and large natural and engineered systems remain stable/fail.</li>
<li>To get an idea about design and analysis of different systems such as dams, buildings, bridges, etc.</li>
</ul>
</div>
</div>

<div id="outline-container-orgca6c2da" class="outline-3">
<h3 id="orgca6c2da">Syllabus</h3>
<div class="outline-text-3" id="text-orgca6c2da">
<ul class="org-ul">
<li>Free body diagram, Modeling of supports, Conditions for Equilibrium.</li>
<li>Friction Force-deformation relationship and geometric compatibility (for small deformations) with illustrations through simple problems on axially loaded members and thin walled pressure vessels.</li>
<li>Axial force, shear force, bending moment, and twisting moment diagrams of slender members.</li>
<li>Concept of stress and strain at a point, Transformation of stresses and strain at a point, Principal stresses and strains, Mohr’s circle (only for plane stress and strain case).</li>
<li>Displacement field, Strain Rosette, Modeling of problem as a plane stress or plane strain problem.</li>
<li>Discussion of experimental results on 1-D material behavior.</li>
<li>Concepts of elasticity, plasticity, strain-hardening, failure (fracture/yielding), idealization of 1-D stress-strain curve, Concepts of isotropy, orthotropy, anisotropy.</li>
<li>Generalized Hooke’s law, (without and with thermal strains).</li>
<li>Torsion of circular shafts and thin-walled tubes.</li>
<li>Bending of beams with symmetric cross-section (normal and shear stresses), Combined stresses, Yield criteria, Deflection due to bending.</li>
<li>Integration of the moment-curvature relationship for simple boundary conditions, Super position principle.</li>
<li>Concepts of strain energy and complementary strain energy for simple structural elements (those under axial load, shear force, bending moment, and torsion).</li>
<li>Castigliano’s theorems for deflection analysis and indeterminate problems.</li>
<li>Concept of elastic instability and a brief introduction to column buckling and Euler’s formula.</li>
</ul>
</div>
</div>

<div id="outline-container-orga64503c" class="outline-3">
<h3 id="orga64503c">Textbook</h3>
<div class="outline-text-3" id="text-orga64503c">
<ul class="org-ul">
<li><b>B1</b>: Engineering Mechanics: Statics - R.C. Hibbeler (14th edition).</li>
<li><b>B2</b>: Mechanics of Materials - R.C. Hibbeler (10th edition).</li>
</ul>
</div>
</div>

<div id="outline-container-org028f4fb" class="outline-3">
<h3 id="org028f4fb">Reference Books</h3>
<div class="outline-text-3" id="text-org028f4fb">
<ul class="org-ul">
<li>Strength of Materials - S. Timoshenko.</li>
</ul>
</div>
</div>

<div id="outline-container-orgd82c431" class="outline-3">
<h3 id="orgd82c431">Pre-requisites</h3>
<div class="outline-text-3" id="text-orgd82c431">
<ul class="org-ul">
<li>Good background in Mathematics.</li>
<li>Curiosity to learn the fundamentals behind construction of some of the largest structures like Hoover Dam and Burj Khalifa.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org2a4e6d7" class="outline-2">
<h2 id="org2a4e6d7">Course Policies</h2>
<div class="outline-text-2" id="text-org2a4e6d7">
</div>
<div id="outline-container-org841463a" class="outline-3">
<h3 id="org841463a">Etiquette</h3>
<div class="outline-text-3" id="text-org841463a">
<ul class="org-ul">
<li>Please be considerate about everyone's time.</li>
<li>In all emails pertaining to this course, please have "ES221" in the subject line.
<ul class="org-ul">
<li>(note that there is no space or hyphen or anything between ES and 221)</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgcae379e" class="outline-3">
<h3 id="orgcae379e">Cheating</h3>
<div class="outline-text-3" id="text-orgcae379e">
<p>
Cheating cases (assignments/codes/exams/project) will be dealt with in accordance with the Institute norms. It is expected that everyone will uphold the honor code.
</p>
</div>
</div>

<div id="outline-container-orgf75d4e4" class="outline-3">
<h3 id="orgf75d4e4">Grading</h3>
<div class="outline-text-3" id="text-orgf75d4e4">
<p>
Following will be the weightage of different components of assessment
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Component</th>
<th scope="col" class="org-right">Weightage</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Homework assignments</td>
<td class="org-right">20%</td>
</tr>

<tr>
<td class="org-left">In-class submissions</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Tutorials</td>
<td class="org-right">25%</td>
</tr>

<tr>
<td class="org-left">Exams (two)</td>
<td class="org-right">15% each</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org4366d18" class="outline-3">
<h3 id="org4366d18">Modes of formal assessment</h3>
<div class="outline-text-3" id="text-org4366d18">
<ul class="org-ul">
<li>Tutorials will involve two types of problems:
<ul class="org-ul">
<li>Set A: to be submitted within the tutorial session and will be graded towards Tutorial weightage</li>
<li>Set B: to be practiced outside the tutorial hour and will not be graded</li>
</ul></li>
<li>Assignments will entail analysis/practical problems, reports, etc. and may be individual or group</li>
<li>Expect one assignment and tutorial per week.</li>
<li>All assignments and tutorials can be downloaded from <a href="https://drive.google.com/drive/folders/1xh3KbURRTQPupLBcsRxMVuHeTEFI5BDN?usp=drive_link">this google folder</a>.</li>
</ul>
</div>
</div>

<div id="outline-container-orge67d35a" class="outline-3">
<h3 id="orge67d35a">Emphasis on self-learning</h3>
<div class="outline-text-3" id="text-orge67d35a">
<p>
It is important to develop the habit of self-learning. A number of reading assignments and self-exercises will be given during the course. These will not be formally graded and it will be expected that students will go through them on a regular basis on their own.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc69d4dc" class="outline-2">
<h2 id="orgc69d4dc">Calendar (tentative)</h2>
<div class="outline-text-2" id="text-orgc69d4dc">
</div>
<div id="outline-container-org3c38f86" class="outline-3">
<h3 id="org3c38f86">[L1] Aug 02, Fri</h3>
<div class="outline-text-3" id="text-org3c38f86">
<ul class="org-ul">
<li>Introduction to the subject, solids vs. fluids, rigidity vs. flexibility. Failure modes of solids.</li>
<li>Fundamental vs. derived quantities, dimensional analysis.</li>
<li>SI units (base and derived).</li>
<li>Significant figures and scientific notation, rounding off.</li>
<li>Newton's laws of motion - first, second and third.</li>
<li>Force systems - coplanar, collinear, concurrent.</li>
<li>Moment of force.</li>
<li>Resultant force and moment. Equations of static equilibrium.</li>
<li><i>Reading from the book (B1)</i>: Chapters 1-4.</li>
</ul>
</div>
</div>
<div id="outline-container-orge56ad6e" class="outline-3">
<h3 id="orge56ad6e">[T1] Aug 05, Mon</h3>
<div class="outline-text-3" id="text-orge56ad6e">
<ul class="org-ul">
<li>Review of topics from Class XI.</li>
</ul>
</div>
</div>
<div id="outline-container-orgce31b71" class="outline-3">
<h3 id="orgce31b71">[L2] Aug 07, Wed</h3>
<div class="outline-text-3" id="text-orgce31b71">
<ul class="org-ul">
<li>Moment of a force, couple moment. Equations of static equilibrium.</li>
<li>Idealization of supports - fixed, roller, hinged.</li>
<li>External and internal forces.</li>
<li>Examples of determining support reactions and internal forces.</li>
<li><i>Reading from the book (B1)</i>: Chapter 5.</li>
</ul>
</div>
</div>
<div id="outline-container-orgaf2afb7" class="outline-3">
<h3 id="orgaf2afb7">[L3] Aug 09, Fri</h3>
<div class="outline-text-3" id="text-orgaf2afb7">
<ul class="org-ul">
<li>Two-force members.</li>
<li>Introduction to truss structures.</li>
<li>Analysis of pin-jointed trusses by method of joints.</li>
<li><i>Reading from the book (B1)</i>: Chapters 5 &amp; 6.</li>
</ul>
</div>
</div>
<div id="outline-container-org91f7414" class="outline-3">
<h3 id="org91f7414">[L4] Aug 14, Wed</h3>
<div class="outline-text-3" id="text-org91f7414">
<ul class="org-ul">
<li><i>In-class submission C1</i></li>
<li>Analysis of pin-jointed trusses by method of sections.</li>
<li><i>Reading from the book (B1)</i>: Chapter 6.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0a91b4" class="outline-3">
<h3 id="orgf0a91b4">Aug 15, Thu - holiday (Independence Day)</h3>
</div>
<div id="outline-container-orgd6759ce" class="outline-3">
<h3 id="orgd6759ce">[L5] Aug 16, Fri</h3>
<div class="outline-text-3" id="text-orgd6759ce">
<ul class="org-ul">
<li>Classification and idealization of structural members by geometry (1D, 2D, 3D).</li>
<li>Classification and idealization of structural members by resisting action (tie, strut, beam, column, shaft).</li>
<li>Bending moment and shear forces in beams. Sign convention for bending moment.</li>
<li><i>Reading from the book (B1)</i>: Chapter 7.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf812253" class="outline-3">
<h3 id="orgf812253">[L6] Aug 21, Wed</h3>
<div class="outline-text-3" id="text-orgf812253">
<ul class="org-ul">
<li>Class cancelled.</li>
</ul>
</div>
</div>
<div id="outline-container-org59d9ab0" class="outline-3">
<h3 id="org59d9ab0">[T2] Aug 22, Thu</h3>
<div class="outline-text-3" id="text-org59d9ab0">
<ul class="org-ul">
<li>Analysis of pin-jointed trusses.</li>
</ul>
</div>
</div>
<div id="outline-container-org2f2d368" class="outline-3">
<h3 id="org2f2d368">[L7] Aug 23, Fri</h3>
<div class="outline-text-3" id="text-org2f2d368">
<ul class="org-ul">
<li><i>Assignment 1</i> given (due on 30 Aug).</li>
<li>Bending moment and shear force diagrams. Sign convention for shear force.</li>
<li><i>Reading from the book (B1)</i>: Chapter 7.</li>
</ul>
</div>
</div>
<div id="outline-container-org9994797" class="outline-3">
<h3 id="org9994797">[L8] Aug 28, Wed</h3>
<div class="outline-text-3" id="text-org9994797">
<ul class="org-ul">
<li>Bending moment and shear force diagrams.</li>
<li><i>Reading from the book (B1)</i>: Chapter 7.</li>
</ul>
</div>
</div>
<div id="outline-container-org7174ddc" class="outline-3">
<h3 id="org7174ddc">[T3] Aug 29, Thu</h3>
<div class="outline-text-3" id="text-org7174ddc">
<ul class="org-ul">
<li>Bending moment and shear force diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-org5b49ba8" class="outline-3">
<h3 id="org5b49ba8">[L9] Aug 30, Fri</h3>
<div class="outline-text-3" id="text-org5b49ba8">
<ul class="org-ul">
<li><i>Assignment 2</i> given (due on 6 Sep).</li>
<li>Concept of stress. Normal and shear stresses. General state of stress. Sign convention.</li>
<li>Area as a vector. Average stresses. Examples of finding normal stress.</li>
<li>Concept of strain. Normal and shear strain. General state of strain. Sign convention.</li>
<li>Average strain. Examples of finding normal strain.</li>
<li><i>Reading from the book (B2)</i>: Chapters 1 and 2.</li>
</ul>
</div>
</div>
<div id="outline-container-org7cc000e" class="outline-3">
<h3 id="org7cc000e">[L10] Sep 04, Wed</h3>
<div class="outline-text-3" id="text-org7cc000e">
<ul class="org-ul">
<li>Material properties. Relations between stress and strain.</li>
<li>Young's modulus, shear modulus, Poisson ratio.</li>
<li>Hooke's law.</li>
</ul>
</div>
</div>
<div id="outline-container-org257914e" class="outline-3">
<h3 id="org257914e">[T4] Sep 05, Thu</h3>
<div class="outline-text-3" id="text-org257914e">
<ul class="org-ul">
<li>Stress and strain computations.</li>
</ul>
</div>
</div>
<div id="outline-container-org05743da" class="outline-3">
<h3 id="org05743da">[L11] Sep 06, Fri</h3>
<div class="outline-text-3" id="text-org05743da">
<ul class="org-ul">
<li>Strain at a point.</li>
<li>Strain compatibility conditions.</li>
<li>Transformation of strain.</li>
<li>Principal stresses.</li>
<li>Principal strains.</li>
<li>Stresses.</li>
<li>Hooke's law and stress-strain relations.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb242c04" class="outline-3">
<h3 id="orgb242c04">[L12] Sep 11, Wed</h3>
<div class="outline-text-3" id="text-orgb242c04">
<ul class="org-ul">
<li>Relations between different elastic constants (Young's modulus, shear modulus, bulk modulus).</li>
<li>Idealization of 1D stress-strain curve.</li>
</ul>
</div>
</div>
<div id="outline-container-orge10e87b" class="outline-3">
<h3 id="orge10e87b">[T5] Sep 12, Thu</h3>
<div class="outline-text-3" id="text-orge10e87b">
<ul class="org-ul">
<li>Strain at a point.</li>
<li>Stress in cylindrical coordinates.</li>
</ul>
</div>
</div>
<div id="outline-container-orgfc7c262" class="outline-3">
<h3 id="orgfc7c262">[L13] Sep 13, Fri</h3>
<div class="outline-text-3" id="text-orgfc7c262">
<ul class="org-ul">
<li>Elastic energy / strain energy in a body.</li>
</ul>
</div>
</div>
<div id="outline-container-org408befa" class="outline-3">
<h3 id="org408befa">[L14] Sep 18, Wed</h3>
<div class="outline-text-3" id="text-org408befa">
<ul class="org-ul">
<li>Yield criteria and conditions.</li>
</ul>
</div>
</div>
<div id="outline-container-org212f527" class="outline-3">
<h3 id="org212f527">[T6] Sep 19, Thu</h3>
</div>
<div id="outline-container-org86cc61c" class="outline-3">
<h3 id="org86cc61c">[L15] Sep 20, Fri</h3>
<div class="outline-text-3" id="text-org86cc61c">
<ul class="org-ul">
<li>Equivalence of yield stresses.</li>
</ul>
</div>
</div>
<div id="outline-container-org2336968" class="outline-3">
<h3 id="org2336968">[L16] Sep 25, Wed</h3>
<div class="outline-text-3" id="text-org2336968">
<ul class="org-ul">
<li>Review of topics.</li>
</ul>
</div>
</div>
<div id="outline-container-org4deffa1" class="outline-3">
<h3 id="org4deffa1">[T7] Sep 24, Thu</h3>
<div class="outline-text-3" id="text-org4deffa1">
<ul class="org-ul">
<li>Strain energy and yield conditions.</li>
<li>Failure theories.</li>
</ul>
</div>
</div>
<div id="outline-container-org8d754fd" class="outline-3">
<h3 id="org8d754fd">Sep 27 - Oct 04: Mid semester exam week</h3>
</div>
<div id="outline-container-org74cb893" class="outline-3">
<h3 id="org74cb893">Oct 05 - 13: Mid semester recess</h3>
</div>
<div id="outline-container-org6476e97" class="outline-3">
<h3 id="org6476e97">[L17] Oct 16, Wed</h3>
<div class="outline-text-3" id="text-org6476e97">
<ul class="org-ul">
<li>Consideration of bending.</li>
<li>Shear force and bending moment diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-org01aad92" class="outline-3">
<h3 id="org01aad92">[T8] Oct 17, Thu</h3>
<div class="outline-text-3" id="text-org01aad92">
<ul class="org-ul">
<li>Failure theories.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf244867" class="outline-3">
<h3 id="orgf244867">[L18] Oct 18, Fri</h3>
<div class="outline-text-3" id="text-orgf244867">
<ul class="org-ul">
<li>Shear force and bending moment diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-org316a38d" class="outline-3">
<h3 id="org316a38d">[L19] Oct 23, Wed</h3>
<div class="outline-text-3" id="text-org316a38d">
<ul class="org-ul">
<li>Stresses due to bending.</li>
</ul>
</div>
</div>
<div id="outline-container-org23d06ca" class="outline-3">
<h3 id="org23d06ca">[T9] Oct 24, Thu</h3>
<div class="outline-text-3" id="text-org23d06ca">
<ul class="org-ul">
<li>Shear force and bending moment diagrams.</li>
</ul>
</div>
</div>
<div id="outline-container-orge3e903e" class="outline-3">
<h3 id="orge3e903e">[L20] Oct 25, Fri</h3>
<div class="outline-text-3" id="text-orge3e903e">
<ul class="org-ul">
<li>Stresses due to bending.</li>
</ul>
</div>
</div>
<div id="outline-container-org5ed8413" class="outline-3">
<h3 id="org5ed8413">[L21] Oct 30, Wed</h3>
<div class="outline-text-3" id="text-org5ed8413">
<ul class="org-ul">
<li>Deflections due to bending.</li>
</ul>
</div>
</div>
<div id="outline-container-org4565d60" class="outline-3">
<h3 id="org4565d60">[T10] Oct 31, Thu</h3>
<div class="outline-text-3" id="text-org4565d60">
<ul class="org-ul">
<li>Stresses due to bending.</li>
</ul>
</div>
</div>
<div id="outline-container-org01d8eef" class="outline-3">
<h3 id="org01d8eef">[L22] Nov 01, Fri</h3>
<div class="outline-text-3" id="text-org01d8eef">
<ul class="org-ul">
<li>Torsion of circular members.</li>
</ul>
</div>
</div>
<div id="outline-container-orgb7d6c4f" class="outline-3">
<h3 id="orgb7d6c4f">[L23] Nov 06, Wed</h3>
<div class="outline-text-3" id="text-orgb7d6c4f">
<ul class="org-ul">
<li>Castigliano's theorems.</li>
</ul>
</div>
</div>
<div id="outline-container-orgd202da3" class="outline-3">
<h3 id="orgd202da3">[T11] Nov 07, Thu</h3>
<div class="outline-text-3" id="text-orgd202da3">
<ul class="org-ul">
<li>Deflections due to bending.</li>
</ul>
</div>
</div>
<div id="outline-container-org302e430" class="outline-3">
<h3 id="org302e430">[L24] Nov 08, Fri</h3>
<div class="outline-text-3" id="text-org302e430">
<ul class="org-ul">
<li>Torsion of circular members.</li>
<li>State of stress in members with torsion and axial force.</li>
</ul>
</div>
</div>
<div id="outline-container-org4bc2ae4" class="outline-3">
<h3 id="org4bc2ae4">[L25] Nov 13, Wed</h3>
<div class="outline-text-3" id="text-org4bc2ae4">
<ul class="org-ul">
<li>Stability of equilibrium.</li>
<li>Buckling of slender members.</li>
</ul>
</div>
</div>
<div id="outline-container-org1bfd6a7" class="outline-3">
<h3 id="org1bfd6a7">[T12] Nov 14, Thu</h3>
<div class="outline-text-3" id="text-org1bfd6a7">
<ul class="org-ul">
<li>Torsion of circular members.</li>
</ul>
</div>
</div>
<div id="outline-container-orgf1e2cd6" class="outline-3">
<h3 id="orgf1e2cd6">Nov 15, Fri - holiday (Guru Nanak's Birthday)</h3>
</div>
<div id="outline-container-orgfab94e6" class="outline-3">
<h3 id="orgfab94e6">[L26] Nov 20, Wed</h3>
<div class="outline-text-3" id="text-orgfab94e6">
<ul class="org-ul">
<li>Buckling of slender members.</li>
</ul>
</div>
</div>
<div id="outline-container-org425f45c" class="outline-3">
<h3 id="org425f45c">[T13] Nov 21, Thu</h3>
<div class="outline-text-3" id="text-org425f45c">
<ul class="org-ul">
<li>Stability of equilibrium.</li>
<li>Buckling of slender members.</li>
</ul>
</div>
</div>
<div id="outline-container-org9f06948" class="outline-3">
<h3 id="org9f06948">[L27] Nov 22, Fri</h3>
<div class="outline-text-3" id="text-org9f06948">
<ul class="org-ul">
<li>Review of topics.</li>
</ul>
</div>
</div>
<div id="outline-container-org6ca6d48" class="outline-3">
<h3 id="org6ca6d48">Nov 23 - 29: End semester exam week</h3>
</div>
</div>
</div>
<div id="postamble" class="status">

<footer>
Contact: 
<a href='mailto:gauravs@iitgn.ac.in'>gauravs@iitgn.ac.in</a> (Work) |
<a href='mailto:it.gaurav@gmail.com'>it.gaurav@gmail.com</a> (Personal)
<br>
Created completely through <a href='https://www.gnu.org/software/emacs/'>Gnu Emacs</a> and <a href='https://orgmode.org'>Org Mode</a> (<a href='https://github.com/gaurav-iitgn/gaurav-iitgn.github.io'>source code</a>)
</footer>
</div>
</body>
</html>
